<a href="https://colab.research.google.com/github/CapZondar/Python-first-steps/blob/main/Titanic_Data_Simple_Analysis_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Titanic survival predictions

Project submitted by John Vincent "JT" Aquilizan

Started on 09/20/22

In [2]:
#Initial phase of preparing necessary packages and drive

from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [3]:
import pandas as pd
import numpy as np

In [4]:
filename = '/content/drive/MyDrive/Coding Dojo - Data Science/02 Week 2: Pandas/titanic.csv'
df = pd.read_csv(filename)

In [5]:
#Preview of data to make sure that it has been loaded correctly
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
df.info

<bound method DataFrame.info of      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]>

In [104]:
#Here, filters were made for each of the column needed for each of the questions we want to answers using the data provided.

survived = df['Survived'] == 1
not_survived = df['Survived'] == 0
male = df['Sex'] == 'male'
female = df['Sex'] == 'female'
less_than_10 = df['Fare'] < 10

#To somewhat optimize the codes and return the percentage of survivors based on the variables provided

def survive(a,b):
  return (a / b) * 100

In [121]:
#What is the percentage of people who survived?

survivability = survived.sum()/df['Survived'].count()*100
print("The number of people who survived in percentage is ",round(survivability,2),"%")

The number of people who survived in percentage is  38.38 %

In [63]:
#How many of each sex survived?

male_surv = df[male & survived]
female_surv = df[female & survived]

print('The number of male survivors is',male_surv['PassengerId'].count(),'while the female survivor is ',female_surv['PassengerId'].count())

The number of male survivors is 109 while the female survivor is  233

In [122]:
#Considering only the group of passengers who paid less than $10, what percentage of this group survived?
poor = df[less_than_10 & survived]

print('The percentage of people who only paid less than $10 for the ticket that survived is', round(survive(poor['PassengerId'].count(),df['PassengerId'].count()),2),'%')

The percentage of people who only paid less than $10 for the ticket that survived is 7.52 %

In [131]:
#Overall, what is the average age of those who didn't survive?

dead_age = df[not_survived]

print('The average age of people who did not survive Titanic is',round(dead_age['Age'].mean(),))

The average age of people who did not survive Titanic is 31

In [151]:
#Overall, what is the average age of those who did survive?
survive_age = df[survived]

print('The average age of people who did survive Titanic is',round(survive_age['Age'].mean(),))

The average age of people who did survive Titanic is 28

In [171]:
#What is the average age of those who did and didn't survive grouped by Sex?

alive_age = round(df[survived].groupby('Sex')['Age'].mean(),)
dead_age = round(df[not_survived].groupby('Sex')['Age'].mean(),)

print('The average age by sex of people who survived: \na',alive_age,'\n\nThe average age by sex of people who did not survive: \n',dead_age)

The average age by sex of people who survived:
a Sex
female    29.0
male      27.0
Name: Age, dtype: float64

The average age by sex of people who did not survive:
 Sex
female    25.0
male      32.0
Name: Age, dtype: float64